app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("title", "recipe_type", "cuisine", "difficulty", "cook_time", "created_at", "updated_at", "cook_method", "ingredients") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.new(recipe_params)
    if @recipe.save

UPDATE "recipes" SET "title" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["title", "Bolo de chocolate"], ["updated_at", "2019-09-25 18:50:21.011783"], ["id", 1]]
---
  def update
    if @recipe.update(recipe_params)